RIOT-OS/RIOT/cpu/cc2538/include/vendor/hw_rfcore_xreg.h
#define RFCORE_XREG_FRMFILT1_ACCEPT_FT_0_BEACON_M \
                                0x00000008
#define RFCORE_XREG_FRMFILT1_ACCEPT_FT_0_BEACON_S 3
#define RFCORE_XREG_FRMFILT1_MODIFY_FT_FILTER_M \
                                0x00000006  // These bits are used to modify 
                                            // the frame type field of a 
                                            // received frame before frame type 
                                            // filtering is performed. The 
                                            // modification does not influence 
                                            // the frame that is written to the 
                                            // RX FIFO. 00: Leave the frame 
                                            // type as it is. 01: Invert MSB of 
                                            // the frame type. 10: Set MSB of 
                                            // the frame type to 0. 11: Set MSB 
                                            // of the frame type to 1. 

#define RFCORE_XREG_FRMFILT1_MODIFY_FT_FILTER_S 1
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_SRCMATCH register.
//
//*****************************************************************************
#define RFCORE_XREG_SRCMATCH_PEND_DATAREQ_ONLY \
                                0x00000004  // When this bit is set, the 
                                            // AUTOPEND function also requires 
                                            // that the received frame is a 
                                            // DATA REQUEST MAC command frame. 

#define RFCORE_XREG_SRCMATCH_PEND_DATAREQ_ONLY_M \
                                0x00000004
#define RFCORE_XREG_SRCMATCH_PEND_DATAREQ_ONLY_S 2
#define RFCORE_XREG_SRCMATCH_AUTOPEND \
                                0x00000002  // Automatic acknowledgment 
                                            // pending flag enable When a frame 
                                            // is received, the pending bit in 
                                            // the (possibly) returned 
                                            // acknowledgment is set 
                                            // automatically when the following 
                                            // conditions are met: - 
                                            // FRMFILT.FRAME_FILTER_EN is set. 
                                            // - SRCMATCH.SRC_MATCH_EN is set. 
                                            // - SRCMATCH.AUTOPEND is set. - 
                                            // The received frame matches the 
                                            // current 
                                            // SRCMATCH.PEND_DATAREQ_ONLY 
                                            // setting. - The received source 
                                            // address matches at least one 
                                            // source match table entry, which 
                                            // is enabled in SHORT_ADDR_EN and 
                                            // SHORT_PEND_EN or in EXT_ADDR_EN 
                                            // and EXT_PEND_EN. 

#define RFCORE_XREG_SRCMATCH_AUTOPEND_M \
                                0x00000002
#define RFCORE_XREG_SRCMATCH_AUTOPEND_S 1
#define RFCORE_XREG_SRCMATCH_SRC_MATCH_EN \
                                0x00000001  // Source address matching enable 
                                            // (requires that 
                                            // FRMFILT.FRAME_FILTER_EN = 1) 

#define RFCORE_XREG_SRCMATCH_SRC_MATCH_EN_M \
                                0x00000001
#define RFCORE_XREG_SRCMATCH_SRC_MATCH_EN_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_SRCSHORTEN0 register.
//
//*****************************************************************************
#define RFCORE_XREG_SRCSHORTEN0_SHORT_ADDR_EN_M \
                                0x000000FF  // 7:0 part of the 24-bit word 
                                            // SHORT_ADDR_EN that enables or 
                                            // disables source address matching 
                                            // for each of the 24 short address 
                                            // table entries Optional safety 
                                            // feature: To ensure that an entry 
                                            // in the source matching table is 
                                            // not used while it is being 
                                            // updated, set the corresponding 
                                            // SHORT_ADDR_EN bit to 0 while 
                                            // updating. 

#define RFCORE_XREG_SRCSHORTEN0_SHORT_ADDR_EN_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_SRCSHORTEN1 register.
//
//*****************************************************************************
#define RFCORE_XREG_SRCSHORTEN1_SHORT_ADDR_EN_M \
                                0x000000FF  // 15:8 part of the 24-bit word 
                                            // SHORT_ADDR_EN See description of 
                                            // SRCSHORTEN0.SHORT_ADDR_EN. 

#define RFCORE_XREG_SRCSHORTEN1_SHORT_ADDR_EN_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_SRCSHORTEN2 register.
//
//*****************************************************************************
#define RFCORE_XREG_SRCSHORTEN2_SHORT_ADDR_EN_M \
                                0x000000FF  // 23:16 part of the 24-bit word 
                                            // SHORT_ADDR_EN See description of 
                                            // SRCSHORTEN0.SHORT_ADDR_EN. 

#define RFCORE_XREG_SRCSHORTEN2_SHORT_ADDR_EN_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_SRCEXTEN0 register.
//
//*****************************************************************************
#define RFCORE_XREG_SRCEXTEN0_EXT_ADDR_EN_M \
                                0x000000FF  // 7:0 part of the 24-bit word 
                                            // EXT_ADDR_EN that enables or 
                                            // disables source address matching 
                                            // for each of the 12 extended 
                                            // address table entries Write 
                                            // access: Extended address enable 
                                            // for table entry n (0 to 11) is 
                                            // mapped to EXT_ADDR_EN[2n]. All 
                                            // EXT_ADDR_EN[2n + 1] bits are 
                                            // read only. Read access: Extended 
                                            // address enable for table entry n 
                                            // (0 to 11) is mapped to 
                                            // EXT_ADDR_EN[2n] and 
                                            // EXT_ADDR_EN[2n + 1]. Optional 
                                            // safety feature: To ensure that 
                                            // an entry in the source matching 
                                            // table is not used while it is 
                                            // being updated, set the 
                                            // corresponding EXT_ADDR_EN bit to 
                                            // 0 while updating. 

#define RFCORE_XREG_SRCEXTEN0_EXT_ADDR_EN_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_SRCEXTEN1 register.
//
//*****************************************************************************
#define RFCORE_XREG_SRCEXTEN1_EXT_ADDR_EN_M \
                                0x000000FF  // 15:8 part of the 24-bit word 
                                            // EXT_ADDR_EN See description of 
                                            // SRCEXTEN0.EXT_ADDR_EN. 

#define RFCORE_XREG_SRCEXTEN1_EXT_ADDR_EN_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_SRCEXTEN2 register.
//
//*****************************************************************************
#define RFCORE_XREG_SRCEXTEN2_EXT_ADDR_EN_M \
                                0x000000FF  // 23:16 part of the 24-bit word 
                                            // EXT_ADDR_EN See description of 
                                            // SRCEXTEN0.EXT_ADDR_EN. 

#define RFCORE_XREG_SRCEXTEN2_EXT_ADDR_EN_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_FRMCTRL0 register.
//
//*****************************************************************************
#define RFCORE_XREG_FRMCTRL0_APPEND_DATA_MODE \
                                0x00000080  // When AUTOCRC = 0: Don't care 
                                            // When AUTOCRC = 1: 0: RSSI + The 
                                            // CRC_OK bit and the 7-bit 
                                            // correlation value are appended 
                                            // at the end of each received 
                                            // frame 1: RSSI + The CRC_OK bit 
                                            // and the 7-bit SRCRESINDEX are 
                                            // appended at the end of each 
                                            // received frame. 

