RIOT-OS/RIOT/cpu/cc2538/include/vendor/hw_rfcore_xreg.h
#define RFCORE_XREG_FRMCTRL0_APPEND_DATA_MODE_M \
                                0x00000080
#define RFCORE_XREG_FRMCTRL0_APPEND_DATA_MODE_S 7
#define RFCORE_XREG_FRMCTRL0_AUTOCRC \
                                0x00000040  // In TX 1: A CRC-16 (ITU-T) is 
                                            // generated in hardware and 
                                            // appended to the transmitted 
                                            // frame. There is no need to write 
                                            // the last 2 bytes to TXBUF. 0: No 
                                            // CRC-16 is appended to the frame. 
                                            // The last 2 bytes of the frame 
                                            // must be generated manually and 
                                            // written to TXBUF (if not, 
                                            // TX_UNDERFLOW occurs). In RX 1: 
                                            // The CRC-16 is checked in 
                                            // hardware, and replaced in the 
                                            // RXFIFO by a 16-bit status word 
                                            // which contains a CRC OK bit. The 
                                            // status word is controllable 
                                            // through APPEND_DATA_MODE. 0: The 
                                            // last 2 bytes of the frame 
                                            // (CRC-16 field) are stored in the 
                                            // RX FIFO. The CRC (if any) must 
                                            // be done manually. This setting 
                                            // does not influence 
                                            // acknowledgment transmission 
                                            // (including AUTOACK). 

#define RFCORE_XREG_FRMCTRL0_AUTOCRC_M \
                                0x00000040
#define RFCORE_XREG_FRMCTRL0_AUTOCRC_S 6
#define RFCORE_XREG_FRMCTRL0_AUTOACK \
                                0x00000020  // Defines whether the radio 
                                            // automatically transmits 
                                            // acknowledge frames or not. When 
                                            // autoack is enabled, all frames 
                                            // that are accepted by address 
                                            // filtering, have the acknowledge 
                                            // request flag set, and have a 
                                            // valid CRC are automatically 
                                            // acknowledged 12 symbol periods 
                                            // after being received. 0: Autoack 
                                            // disabled 1: Autoack enabled 

#define RFCORE_XREG_FRMCTRL0_AUTOACK_M \
                                0x00000020
#define RFCORE_XREG_FRMCTRL0_AUTOACK_S 5
#define RFCORE_XREG_FRMCTRL0_ENERGY_SCAN \
                                0x00000010  // Defines whether the RSSI 
                                            // register contains the 
                                            // most-recent signal strength or 
                                            // the peak signal strength since 
                                            // the energy scan was enabled. 0: 
                                            // Most-recent signal strength 1: 
                                            // Peak signal strength 

#define RFCORE_XREG_FRMCTRL0_ENERGY_SCAN_M \
                                0x00000010
#define RFCORE_XREG_FRMCTRL0_ENERGY_SCAN_S 4
#define RFCORE_XREG_FRMCTRL0_RX_MODE_M \
                                0x0000000C  // Set RX modes. 00: Normal 
                                            // operation, use RX FIFO 01: 
                                            // Receive serial mode, output 
                                            // received data on to IOC; 
                                            // infinite RX 10: RX FIFO looping 
                                            // ignore overflow in RX FIFO; 
                                            // infinite reception 11: Same as 
                                            // normal operation except that 
                                            // symbol search is disabled. Can 
                                            // be used for RSSI or CCA 
                                            // measurements when finding symbol 
                                            // is not desired. 

#define RFCORE_XREG_FRMCTRL0_RX_MODE_S 2
#define RFCORE_XREG_FRMCTRL0_TX_MODE_M \
                                0x00000003  // Set test modes for TX. 00: 
                                            // Normal operation, transmit TX 
                                            // FIFO 01: Reserved, should not be 
                                            // used 10: TX FIFO looping ignore 
                                            // underflow in TX FIFO and read 
                                            // cyclic; infinite transmission 
                                            // 11: Send random data from CRC; 
                                            // infinite transmission 

#define RFCORE_XREG_FRMCTRL0_TX_MODE_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_FRMCTRL1 register.
//
//*****************************************************************************
#define RFCORE_XREG_FRMCTRL1_PENDING_OR \
                                0x00000004  // Defines whether the pending 
                                            // data bit in outgoing 
                                            // acknowledgment frames is always 
                                            // set to 1 or controlled by the 
                                            // main FSM and the address 
                                            // filtering 0: Pending data bit is 
                                            // controlled by main FSM and 
                                            // address filtering. 1: Pending 
                                            // data bit is always 1. 

