RIOT-OS/RIOT/cpu/cc2538/include/vendor/hw_rfcore_xreg.h
#define RFCORE_XREG_FRMCTRL1_PENDING_OR_M \
                                0x00000004
#define RFCORE_XREG_FRMCTRL1_PENDING_OR_S 2
#define RFCORE_XREG_FRMCTRL1_IGNORE_TX_UNDERF \
                                0x00000002  // Defines whether or not TX 
                                            // underflow should be ignored 0: 
                                            // Normal TX operation. TX 
                                            // underflow is detected and TX is 
                                            // aborted if underflow occurs. 1: 
                                            // Ignore TX underflow. Transmit 
                                            // the number of bytes given by the 
                                            // frame-length field. 

#define RFCORE_XREG_FRMCTRL1_IGNORE_TX_UNDERF_M \
                                0x00000002
#define RFCORE_XREG_FRMCTRL1_IGNORE_TX_UNDERF_S 1
#define RFCORE_XREG_FRMCTRL1_SET_RXENMASK_ON_TX \
                                0x00000001  // Defines whether STXON sets bit 
                                            // 6 in the RXENABLE register or 
                                            // leaves it unchanged 0: Does not 
                                            // affect RXENABLE 1: Sets bit 6 in 
                                            // RXENABLE. Used for backward 
                                            // compatibility with the CC2420. 

#define RFCORE_XREG_FRMCTRL1_SET_RXENMASK_ON_TX_M \
                                0x00000001
#define RFCORE_XREG_FRMCTRL1_SET_RXENMASK_ON_TX_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_RXENABLE register.
//
//*****************************************************************************
#define RFCORE_XREG_RXENABLE_RXENMASK_M \
                                0x000000FF  // RXENABLE enables the receiver. 
                                            // A nonzero value in this register 
                                            // causes FFCTRL to enable the 
                                            // receiver when in idle, after 
                                            // transmission and after 
                                            // acknowledgement transmission. 
                                            // The following strobes can modify 
                                            // RXENMASK: SRXON: Set bit 7 in 
                                            // RXENMASK. STXON: Set bit 6 in 
                                            // RXENMASK if SET_RXENMASK_ON_TX = 
                                            // 1. SRFOFF: Clears all bits in 
                                            // RXENMASK. SRXMASKBITSET: Set bit 
                                            // 5 in RXENMASK. SRXMASKBITCLR: 
                                            // Clear bit 5 in RXENMASK. There 
                                            // could be conflicts between the 
                                            // CSP and xreg_bus write 
                                            // operations if both operations 
                                            // try to modify RXENMASK 
                                            // simultaneously. To handle the 
                                            // case of simultaneous access to 
                                            // RXENMASK the following rules 
                                            // apply: - If the two sources 
                                            // agree (they modify different 
                                            // parts of the register) both of 
                                            // their requests to modify 
                                            // RXENMASK are processed. - If 
                                            // both operations try to modify 
                                            // the mask simultaneously, bus 
                                            // write operations to RXMASKSET 
                                            // and RXMASKCLR have priority over 
                                            // the CSP. This situation must be 
                                            // avoided. 

#define RFCORE_XREG_RXENABLE_RXENMASK_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_RXMASKSET register.
//
//*****************************************************************************
#define RFCORE_XREG_RXMASKSET_RXENMASKSET_M \
                                0x000000FF  // When written, the written data 
                                            // is ORed with the RXENMASK and 
                                            // stored in RXENMASK. 

#define RFCORE_XREG_RXMASKSET_RXENMASKSET_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_RXMASKCLR register.
//
//*****************************************************************************
#define RFCORE_XREG_RXMASKCLR_RXENMASKCLR_M \
                                0x000000FF  // When written, the written data 
                                            // is inverted and ANDed with the 
                                            // RXENMASK and stored in RXENMASK. 
                                            // For example, if 1 is written to 
                                            // one or more bit positions in 
                                            // this register, the corresponding 
                                            // bits are cleared in RXENMASK. 

#define RFCORE_XREG_RXMASKCLR_RXENMASKCLR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_FREQTUNE register.
//
//*****************************************************************************
#define RFCORE_XREG_FREQTUNE_XOSC32M_TUNE_M \
                                0x0000000F  // Tune crystal oscillator The 
                                            // default setting 1111 leaves the 
                                            // XOSC untuned. Changing the 
                                            // setting from the default setting 
                                            // (1111) switches in extra 
                                            // capacitance to the oscillator, 
                                            // effectively lowering the XOSC 
                                            // frequency. Hence, a higher 
                                            // setting gives a higher 
                                            // frequency. 

#define RFCORE_XREG_FREQTUNE_XOSC32M_TUNE_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_FREQCTRL register.
//
//*****************************************************************************
#define RFCORE_XREG_FREQCTRL_FREQ_M \
                                0x0000007F  // Frequency control word The 
                                            // frequency word in FREQ[6:0] is 
                                            // an offset value from 2394 (fRF = 
                                            // FREQ[6 0] + 2394). The 
                                            // RF-frequency is specified from 
                                            // 2405 to 2480 MHz in 1-MHz steps; 
                                            // hence, the only valid settings 
                                            // for FREQ[6:0] are 11 to 86 (11 + 
                                            // 2394 = 2405 and 86 + 2394 = 
                                            // 2480). The device supports the 
                                            // frequency range from 2394 to 
                                            // 2507 MHz. Consequently, the 
                                            // usable settings for FREQ[6:0] 
                                            // are 0 to 113. Settings outside 
                                            // of the usable range (114 to 127) 
                                            // give a frequency of 2507 MHz. 
                                            // IEEE 802.15.4-2006 specifies a 
                                            // frequency range from 2405 MHz to 
                                            // 2480 MHz with 16 channels 5 MHz 
                                            // apart. The channels are numbered 
                                            // 11 through 26. For an IEEE 
                                            // 802.15.4-2006 compliant system, 
                                            // the only valid settings are thus 
                                            // FREQ[6:0] = 11 + 5 (channel 
                                            // number - 11). 

