RIOT-OS/RIOT/cpu/cc2538/include/vendor/hw_rfcore_xreg.h
#define RFCORE_XREG_RXFIRST_DATA_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_RXFIFOCNT register.
//
//*****************************************************************************
#define RFCORE_XREG_RXFIFOCNT_RXFIFOCNT_M \
                                0x000000FF  // Number of bytes in the RX FIFO 
                                            // (unsigned integer) 

#define RFCORE_XREG_RXFIFOCNT_RXFIFOCNT_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_TXFIFOCNT register.
//
//*****************************************************************************
#define RFCORE_XREG_TXFIFOCNT_TXFIFOCNT_M \
                                0x000000FF  // Number of bytes in the TX FIFO 
                                            // (unsigned integer) 

#define RFCORE_XREG_TXFIFOCNT_TXFIFOCNT_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_RXFIRST_PTR register.
//
//*****************************************************************************
#define RFCORE_XREG_RXFIRST_PTR_RXFIRST_PTR_M \
                                0x000000FF  // RAM address offset of the first 
                                            // byte in the RX FIFO 

#define RFCORE_XREG_RXFIRST_PTR_RXFIRST_PTR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_RXLAST_PTR register.
//
//*****************************************************************************
#define RFCORE_XREG_RXLAST_PTR_RXLAST_PTR_M \
                                0x000000FF  // RAM address offset of the last 
                                            // byte + 1 byte in the RX FIFO 

#define RFCORE_XREG_RXLAST_PTR_RXLAST_PTR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_RXP1_PTR register.
//
//*****************************************************************************
#define RFCORE_XREG_RXP1_PTR_RXP1_PTR_M \
                                0x000000FF  // RAM address offset of the first 
                                            // byte of the first frame in the 
                                            // RX FIFO 

#define RFCORE_XREG_RXP1_PTR_RXP1_PTR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_TXFIRST_PTR register.
//
//*****************************************************************************
#define RFCORE_XREG_TXFIRST_PTR_TXFIRST_PTR_M \
                                0x000000FF  // RAM address offset of the next 
                                            // byte to be transmitted from the 
                                            // TX FIFO 

#define RFCORE_XREG_TXFIRST_PTR_TXFIRST_PTR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_TXLAST_PTR register.
//
//*****************************************************************************
#define RFCORE_XREG_TXLAST_PTR_TXLAST_PTR_M \
                                0x000000FF  // RAM address offset of the last 
                                            // byte + 1 byte of the TX FIFO 

#define RFCORE_XREG_TXLAST_PTR_TXLAST_PTR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_RFIRQM0 register.
//
//*****************************************************************************
#define RFCORE_XREG_RFIRQM0_RFIRQM_M \
                                0x000000FF  // Bit mask is masking out 
                                            // interrupt sources. Bit position: 
                                            // 7: RXMASKZERO 6: RXPKTDONE 5: 
                                            // FRAME_ACCEPTED 4: 
                                            // SRC_MATCH_FOUND 3: 
                                            // SRC_MATCH_DONE 2: FIFOP 1: SFD 
                                            // 0: ACT_UNUSED 

#define RFCORE_XREG_RFIRQM0_RFIRQM_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_RFIRQM1 register.
//
//*****************************************************************************
#define RFCORE_XREG_RFIRQM1_RFIRQM_M \
                                0x0000003F  // Bit mask is masking out 
                                            // interrupt sources. Bit position: 
                                            // 5: CSP_WAIT 4: CSP_STOP 3: 
                                            // CSP_MANINT 2: RF_IDLE 1: TXDONE 
                                            // 0: TXACKDONE 

#define RFCORE_XREG_RFIRQM1_RFIRQM_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_RFERRM register.
//
//*****************************************************************************
#define RFCORE_XREG_RFERRM_RFERRM_M \
                                0x0000007F  // Bit mask is masking out 
                                            // interrupt sources. Bit position: 
                                            // 6: STROBE_ERR 5: TXUNDERF 4: 
                                            // TXOVERF 3: RXUNDERF 2: RXOVERF 
                                            // 1: RXABO 0: NLOCK 

#define RFCORE_XREG_RFERRM_RFERRM_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_RFRND register.
//
//*****************************************************************************
#define RFCORE_XREG_RFRND_QRND  0x00000002  // Random bit from the Q channel 
                                            // of the receiver 
#define RFCORE_XREG_RFRND_QRND_M \
                                0x00000002
#define RFCORE_XREG_RFRND_QRND_S 1
#define RFCORE_XREG_RFRND_IRND  0x00000001  // Random bit from the I channel 
                                            // of the receiver 
#define RFCORE_XREG_RFRND_IRND_M \
                                0x00000001
#define RFCORE_XREG_RFRND_IRND_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_MDMCTRL0 register.
//
//*****************************************************************************
#define RFCORE_XREG_MDMCTRL0_DEM_NUM_ZEROS_M \
                                0x000000C0  // Sets how many zero symbols must 
                                            // be detected before the sync word 
                                            // when searching for sync. Only 
                                            // one zero symbol is required to 
                                            // have a correlation value above 
                                            // the correlation threshold set in 
                                            // the MDMCTRL1 register. 00: 
                                            // Reserved 01: 1 zero symbol 10: 2 
                                            // zero symbols 11: 3 zero symbols 

