RIOT-OS/RIOT/cpu/cc2538/include/vendor/hw_rfcore_xreg.h
#define RFCORE_XREG_MDMCTRL0_DEM_NUM_ZEROS_S 6
#define RFCORE_XREG_MDMCTRL0_DEMOD_AVG_MODE \
                                0x00000020  // Defines the behavior or the 
                                            // frequency offset averaging 
                                            // filter. 0: Lock average level 
                                            // after preamble match. Restart 
                                            // frequency offset calibration 
                                            // when searching for the next 
                                            // frame. 1: Continuously update 
                                            // average level. 

#define RFCORE_XREG_MDMCTRL0_DEMOD_AVG_MODE_M \
                                0x00000020
#define RFCORE_XREG_MDMCTRL0_DEMOD_AVG_MODE_S 5
#define RFCORE_XREG_MDMCTRL0_PREAMBLE_LENGTH_M \
                                0x0000001E  // The number of preamble bytes 
                                            // (two zero-symbols) to be sent in 
                                            // TX mode before the SFD, encoded 
                                            // in steps of 2 symbols (1 byte). 
                                            // The reset value of 2 is 
                                            // compliant with IEEE 802.15.4. 
                                            // 0000: 2 leading-zero bytes 0001: 
                                            // 3 leading-zero bytes 0010: 4 
                                            // leading-zero bytes ... 1111: 17 
                                            // leading-zero bytes 

#define RFCORE_XREG_MDMCTRL0_PREAMBLE_LENGTH_S 1
#define RFCORE_XREG_MDMCTRL0_TX_FILTER \
                                0x00000001  // Defines the kind of TX filter 
                                            // that is used. The normal TX 
                                            // filter is as defined by the IEEE 
                                            // 802.15.4 standard. Extra 
                                            // filtering may be applied to 
                                            // lower the out-of-band emissions. 
                                            // 0: Normal TX filtering 1: Enable 
                                            // extra filtering 

#define RFCORE_XREG_MDMCTRL0_TX_FILTER_M \
                                0x00000001
#define RFCORE_XREG_MDMCTRL0_TX_FILTER_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_MDMCTRL1 register.
//
//*****************************************************************************
#define RFCORE_XREG_MDMCTRL1_CORR_THR_SFD \
                                0x00000020  // Defines requirements for SFD 
                                            // detection: 0: The correlation 
                                            // value of one of the zero symbols 
                                            // of the preamble must be above 
                                            // the correlation threshold. 1: 
                                            // The correlation value of one 
                                            // zero symbol of the preamble and 
                                            // both symbols in the SFD must be 
                                            // above the correlation threshold. 

#define RFCORE_XREG_MDMCTRL1_CORR_THR_SFD_M \
                                0x00000020
#define RFCORE_XREG_MDMCTRL1_CORR_THR_SFD_S 5
#define RFCORE_XREG_MDMCTRL1_CORR_THR_M \
                                0x0000001F  // Demodulator correlator 
                                            // threshold value, required before 
                                            // SFD search. Threshold value 
                                            // adjusts how the receiver 
                                            // synchronizes to data from the 
                                            // radio. If the threshold is set 
                                            // too low, sync can more easily be 
                                            // found on noise. If set too high, 
                                            // the sensitivity is reduced, but 
                                            // sync is not likely to be found 
                                            // on noise. In combination with 
                                            // DEM_NUM_ZEROS, the system can be 
                                            // tuned so sensitivity is high 
                                            // with less sync found on noise. 

#define RFCORE_XREG_MDMCTRL1_CORR_THR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_FREQEST register.
//
//*****************************************************************************
#define RFCORE_XREG_FREQEST_FREQEST_M \
                                0x000000FF  // Signed 2's-complement value. 
                                            // Contains an estimate of the 
                                            // frequency offset between carrier 
                                            // and the receiver LO. The offset 
                                            // frequency is FREQEST x 7800 Hz. 
                                            // DEM_AVG_MODE controls when this 
                                            // estimate is updated. If 
                                            // DEM_AVG_MODE = 0, it is updated 
                                            // until sync is found. Then the 
                                            // frequency offset estimate is 
                                            // frozen until the end of the 
                                            // received frame. If DEM_AVG_MODE 
                                            // = 1, it is updated as long as 
                                            // the demodulator is enabled. To 
                                            // calculate the correct value, one 
                                            // must use an offset 
                                            // (FREQEST_offset), which can be 
                                            // found in the device data sheet. 
                                            // Real FREQEST value = FREQEST - 
                                            // FREQEST_offset. 

