RIOT-OS/RIOT/cpu/cc2538/include/vendor/hw_rfcore_xreg.h
#define RFCORE_XREG_FSCAL2_VCO_CAPARR_OE_M \
                                0x00000040
#define RFCORE_XREG_FSCAL2_VCO_CAPARR_OE_S 6
#define RFCORE_XREG_FSCAL2_VCO_CAPARR_M \
                                0x0000003F  // VCO capacitor array setting 
                                            // Programmed during calibration 
                                            // Override value when 
                                            // VCO_CAPARR_OE = 1 

#define RFCORE_XREG_FSCAL2_VCO_CAPARR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_FSCAL3 register.
//
//*****************************************************************************
#define RFCORE_XREG_FSCAL3_VCO_DAC_EN_OV \
                                0x00000040  // Enables the VCO DAC when 1 

#define RFCORE_XREG_FSCAL3_VCO_DAC_EN_OV_M \
                                0x00000040
#define RFCORE_XREG_FSCAL3_VCO_DAC_EN_OV_S 6
#define RFCORE_XREG_FSCAL3_VCO_VC_DAC_M \
                                0x0000003C  // Bit vector for programming 
                                            // varactor control voltage from VC 
                                            // DAC 

#define RFCORE_XREG_FSCAL3_VCO_VC_DAC_S 2
#define RFCORE_XREG_FSCAL3_VCO_CAPARR_CAL_CTRL_M \
                                0x00000003  // Calibration accuracy setting 
                                            // for the cap_array calibration 
                                            // part of the calibration 00: 80 
                                            // XOSC periods 01: 100 XOSC 
                                            // periods 10: 125 XOSC periods 11: 
                                            // 250 XOSC periods 

#define RFCORE_XREG_FSCAL3_VCO_CAPARR_CAL_CTRL_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_AGCCTRL0 register.
//
//*****************************************************************************
#define RFCORE_XREG_AGCCTRL0_AGC_DR_XTND_EN \
                                0x00000040  // 0: The AGC performs no 
                                            // adjustment of attenuation in the 
                                            // AAF. 1: The AGC adjusts the gain 
                                            // in the AAF to achieve extra 
                                            // dynamic range for the receiver. 

#define RFCORE_XREG_AGCCTRL0_AGC_DR_XTND_EN_M \
                                0x00000040
#define RFCORE_XREG_AGCCTRL0_AGC_DR_XTND_EN_S 6
#define RFCORE_XREG_AGCCTRL0_AGC_DR_XTND_THR_M \
                                0x0000003F  // If the measured error between 
                                            // the AGC reference magnitude and 
                                            // the actual magnitude in dB is 
                                            // larger than this threshold, the 
                                            // extra attenuation is enabled in 
                                            // the front end. This threshold 
                                            // must be set higher than 0x0C. 
                                            // This feature is enabled by 
                                            // AGC_DR_XTND_EN. 

#define RFCORE_XREG_AGCCTRL0_AGC_DR_XTND_THR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_AGCCTRL1 register.
//
//*****************************************************************************
#define RFCORE_XREG_AGCCTRL1_AGC_REF_M \
                                0x0000003F  // Target value for the AGC 
                                            // control loop, given in 1-dB 
                                            // steps 

#define RFCORE_XREG_AGCCTRL1_AGC_REF_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_AGCCTRL2 register.
//
//*****************************************************************************
#define RFCORE_XREG_AGCCTRL2_LNA1_CURRENT_M \
                                0x000000C0  // Overrride value for LNA 1 Used 
                                            // only when LNA_CURRENT_OE = 1 
                                            // When read, this register returns 
                                            // the current applied gain 
                                            // setting. 00: 0-dB gain 
                                            // (reference level) 01: 3-dB gain 
                                            // 10: Reserved 11: 6-dB gain 

#define RFCORE_XREG_AGCCTRL2_LNA1_CURRENT_S 6
#define RFCORE_XREG_AGCCTRL2_LNA2_CURRENT_M \
                                0x00000038  // Overrride value for LNA 2 Used 
                                            // only when LNA_CURRENT_OE = 1 
                                            // When read, this register returns 
                                            // the current applied gain 
                                            // setting. 000: 0-dB gain 
                                            // (reference level) 001: 3-dB gain 
                                            // 010: 6-dB gain 011: 9-dB gain 
                                            // 100: 12-dB gain 101: 15-dB gain 
                                            // 110: 18-dB gain 111: 21-dB gain 

#define RFCORE_XREG_AGCCTRL2_LNA2_CURRENT_S 3
#define RFCORE_XREG_AGCCTRL2_LNA3_CURRENT_M \
                                0x00000006  // Overrride value for LNA 3 Used 
                                            // only when LNA_CURRENT_OE = 1 
                                            // When read, this register returns 
                                            // the current applied gain 
                                            // setting. 00: 0-dB gain 
                                            // (reference level) 01: 3-dB gain 
                                            // 10: 6-dB gain 11: 9-dB gain 

#define RFCORE_XREG_AGCCTRL2_LNA3_CURRENT_S 1
#define RFCORE_XREG_AGCCTRL2_LNA_CURRENT_OE \
                                0x00000001  // Write 1 to override the AGC LNA 
                                            // current setting with the values 
                                            // above (LNA1_CURRENT, 
                                            // LNA2_CURRENT, and LNA3_CURRENT). 

#define RFCORE_XREG_AGCCTRL2_LNA_CURRENT_OE_M \
                                0x00000001
#define RFCORE_XREG_AGCCTRL2_LNA_CURRENT_OE_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_AGCCTRL3 register.
//
//*****************************************************************************
#define RFCORE_XREG_AGCCTRL3_AGC_SETTLE_WAIT_M \
                                0x00000060  // Timing for AGC to wait for 
                                            // analog gain to settle after a 
                                            // gain change. During this period, 
                                            // the energy measurement in the 
                                            // AGC is paused. 00: 15 periods 
                                            // 01: 20 periods 10: 25 periods 
                                            // 11: 30 periods 

#define RFCORE_XREG_AGCCTRL3_AGC_SETTLE_WAIT_S 5
#define RFCORE_XREG_AGCCTRL3_AGC_WIN_SIZE_M \
                                0x00000018  // Window size for the 
                                            // accumulate-and-dump function in 
                                            // the AGC. 00: 16 samples 01: 32 
                                            // samples 10: 64 samples 11: 128 
                                            // samples 

#define RFCORE_XREG_AGCCTRL3_AGC_WIN_SIZE_S 3
#define RFCORE_XREG_AGCCTRL3_AAF_RP_M \
                                0x00000006  // Overrides the control signals 
                                            // of the AGC to AAF when AAF_RP_OE 
                                            // = 1. When read, it returns the 
                                            // applied signal to the AAF. 00: 
                                            // 9-dB attenuation in AAF 01: 6-dB 
                                            // attenuation in AAF 10: 3-dB 
                                            // attenuation in AAF 11: 0-dB 
                                            // attenuation in AAF (reference 
                                            // level) 

#define RFCORE_XREG_AGCCTRL3_AAF_RP_S 1
#define RFCORE_XREG_AGCCTRL3_AAF_RP_OE \
                                0x00000001  // Override the AAF control 
                                            // signals of the AGC with the 
                                            // values stored in AAF_RP. 

#define RFCORE_XREG_AGCCTRL3_AAF_RP_OE_M \
                                0x00000001
#define RFCORE_XREG_AGCCTRL3_AAF_RP_OE_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_ADCTEST0 register.
//
//*****************************************************************************
#define RFCORE_XREG_ADCTEST0_ADC_VREF_ADJ_M \
                                0x000000C0  // Quantizer threshold control for 
                                            // test and debug 

