RIOT-OS/RIOT/cpu/cc2538/include/vendor/hw_rfcore_xreg.h
#define RFCORE_XREG_CSPPROG2_CSP_INSTR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_CSPPROG3 register.
//
//*****************************************************************************
#define RFCORE_XREG_CSPPROG3_CSP_INSTR_M \
                                0x000000FF  // Byte N of the CSP program 
                                            // memory 

#define RFCORE_XREG_CSPPROG3_CSP_INSTR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_CSPPROG4 register.
//
//*****************************************************************************
#define RFCORE_XREG_CSPPROG4_CSP_INSTR_M \
                                0x000000FF  // Byte N of the CSP program 
                                            // memory 

#define RFCORE_XREG_CSPPROG4_CSP_INSTR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_CSPPROG5 register.
//
//*****************************************************************************
#define RFCORE_XREG_CSPPROG5_CSP_INSTR_M \
                                0x000000FF  // Byte N of the CSP program 
                                            // memory 

#define RFCORE_XREG_CSPPROG5_CSP_INSTR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_CSPPROG6 register.
//
//*****************************************************************************
#define RFCORE_XREG_CSPPROG6_CSP_INSTR_M \
                                0x000000FF  // Byte N of the CSP program 
                                            // memory 

#define RFCORE_XREG_CSPPROG6_CSP_INSTR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_CSPPROG7 register.
//
//*****************************************************************************
#define RFCORE_XREG_CSPPROG7_CSP_INSTR_M \
                                0x000000FF  // Byte N of the CSP program 
                                            // memory 

#define RFCORE_XREG_CSPPROG7_CSP_INSTR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_CSPPROG8 register.
//
//*****************************************************************************
#define RFCORE_XREG_CSPPROG8_CSP_INSTR_M \
                                0x000000FF  // Byte N of the CSP program 
                                            // memory 

#define RFCORE_XREG_CSPPROG8_CSP_INSTR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_CSPPROG9 register.
//
//*****************************************************************************
#define RFCORE_XREG_CSPPROG9_CSP_INSTR_M \
                                0x000000FF  // Byte N of the CSP program 
                                            // memory 

#define RFCORE_XREG_CSPPROG9_CSP_INSTR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_CSPPROG10 register.
//
//*****************************************************************************
#define RFCORE_XREG_CSPPROG10_CSP_INSTR_M \
                                0x000000FF  // Byte N of the CSP program 
                                            // memory 

#define RFCORE_XREG_CSPPROG10_CSP_INSTR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_CSPPROG11 register.
//
//*****************************************************************************
#define RFCORE_XREG_CSPPROG11_CSP_INSTR_M \
                                0x000000FF  // Byte N of the CSP program 
                                            // memory 

#define RFCORE_XREG_CSPPROG11_CSP_INSTR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_CSPPROG12 register.
//
//*****************************************************************************
#define RFCORE_XREG_CSPPROG12_CSP_INSTR_M \
                                0x000000FF  // Byte N of the CSP program 
                                            // memory 

#define RFCORE_XREG_CSPPROG12_CSP_INSTR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_CSPPROG13 register.
//
//*****************************************************************************
#define RFCORE_XREG_CSPPROG13_CSP_INSTR_M \
                                0x000000FF  // Byte N of the CSP program 
                                            // memory 

#define RFCORE_XREG_CSPPROG13_CSP_INSTR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_CSPPROG14 register.
//
//*****************************************************************************
#define RFCORE_XREG_CSPPROG14_CSP_INSTR_M \
                                0x000000FF  // Byte N of the CSP program 
                                            // memory 

#define RFCORE_XREG_CSPPROG14_CSP_INSTR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_CSPPROG15 register.
//
//*****************************************************************************
#define RFCORE_XREG_CSPPROG15_CSP_INSTR_M \
                                0x000000FF  // Byte N of the CSP program 
                                            // memory 

