RIOT-OS/RIOT/cpu/cc2538/include/vendor/hw_rfcore_xreg.h
#define RFCORE_XREG_CSPPROG15_CSP_INSTR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_CSPPROG16 register.
//
//*****************************************************************************
#define RFCORE_XREG_CSPPROG16_CSP_INSTR_M \
                                0x000000FF  // Byte N of the CSP program 
                                            // memory 

#define RFCORE_XREG_CSPPROG16_CSP_INSTR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_CSPPROG17 register.
//
//*****************************************************************************
#define RFCORE_XREG_CSPPROG17_CSP_INSTR_M \
                                0x000000FF  // Byte N of the CSP program 
                                            // memory 

#define RFCORE_XREG_CSPPROG17_CSP_INSTR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_CSPPROG18 register.
//
//*****************************************************************************
#define RFCORE_XREG_CSPPROG18_CSP_INSTR_M \
                                0x000000FF  // Byte N of the CSP program 
                                            // memory 

#define RFCORE_XREG_CSPPROG18_CSP_INSTR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_CSPPROG19 register.
//
//*****************************************************************************
#define RFCORE_XREG_CSPPROG19_CSP_INSTR_M \
                                0x000000FF  // Byte N of the CSP program 
                                            // memory 

#define RFCORE_XREG_CSPPROG19_CSP_INSTR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_CSPPROG20 register.
//
//*****************************************************************************
#define RFCORE_XREG_CSPPROG20_CSP_INSTR_M \
                                0x000000FF  // Byte N of the CSP program 
                                            // memory 

#define RFCORE_XREG_CSPPROG20_CSP_INSTR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_CSPPROG21 register.
//
//*****************************************************************************
#define RFCORE_XREG_CSPPROG21_CSP_INSTR_M \
                                0x000000FF  // Byte N of the CSP program 
                                            // memory 

#define RFCORE_XREG_CSPPROG21_CSP_INSTR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_CSPPROG22 register.
//
//*****************************************************************************
#define RFCORE_XREG_CSPPROG22_CSP_INSTR_M \
                                0x000000FF  // Byte N of the CSP program 
                                            // memory 

#define RFCORE_XREG_CSPPROG22_CSP_INSTR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_CSPPROG23 register.
//
//*****************************************************************************
#define RFCORE_XREG_CSPPROG23_CSP_INSTR_M \
                                0x000000FF  // Byte N of the CSP program 
                                            // memory 

#define RFCORE_XREG_CSPPROG23_CSP_INSTR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_CSPCTRL register.
//
//*****************************************************************************
#define RFCORE_XREG_CSPCTRL_MCU_CTRL \
                                0x00000001  // CSP MCU control input 

#define RFCORE_XREG_CSPCTRL_MCU_CTRL_M \
                                0x00000001
#define RFCORE_XREG_CSPCTRL_MCU_CTRL_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_CSPSTAT register.
//
//*****************************************************************************
#define RFCORE_XREG_CSPSTAT_CSP_RUNNING \
                                0x00000020  // 1: CSP is running. 0: CSP is 
                                            // idle. 

#define RFCORE_XREG_CSPSTAT_CSP_RUNNING_M \
                                0x00000020
#define RFCORE_XREG_CSPSTAT_CSP_RUNNING_S 5
#define RFCORE_XREG_CSPSTAT_CSP_PC_M \
                                0x0000001F  // CSP program counter 

#define RFCORE_XREG_CSPSTAT_CSP_PC_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_CSPX register.
//
//*****************************************************************************
#define RFCORE_XREG_CSPX_CSPX_M 0x000000FF  // Used by CSP instructions WAITX, 
                                            // RANDXY, INCX, DECX, and 
                                            // conditional instructions. 
#define RFCORE_XREG_CSPX_CSPX_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_CSPY register.
//
//*****************************************************************************
#define RFCORE_XREG_CSPY_CSPY_M 0x000000FF  // Used by CSP instructions 
                                            // RANDXY, INCY, DECY, and 
                                            // conditional instructions. 
#define RFCORE_XREG_CSPY_CSPY_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_CSPZ register.
//
//*****************************************************************************
#define RFCORE_XREG_CSPZ_CSPZ_M 0x000000FF  // Used by CSP instructions INCZ, 
                                            // DECZ, and conditional 
                                            // instructions. 
#define RFCORE_XREG_CSPZ_CSPZ_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_CSPT register.
//
//*****************************************************************************
#define RFCORE_XREG_CSPT_CSPT_M 0x000000FF  // Content is decremented each 
                                            // time the MAC Timer overflows 
                                            // while the CSP program is 
                                            // running. The SCP program stops 
                                            // when decremented to 0. Setting 
                                            // CSPT = 0xFF prevents the 
                                            // register from being decremented. 
#define RFCORE_XREG_CSPT_CSPT_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_RFC_OBS_CTRL0 register.
//
//*****************************************************************************
#define RFCORE_XREG_RFC_OBS_CTRL0_RFC_OBS_POL0 \
                                0x00000040  // The signal chosen by 
                                            // RFC_OBS_MUX0 is XORed with this 
                                            // bit. 

#define RFCORE_XREG_RFC_OBS_CTRL0_RFC_OBS_POL0_M \
                                0x00000040
#define RFCORE_XREG_RFC_OBS_CTRL0_RFC_OBS_POL0_S 6
#define RFCORE_XREG_RFC_OBS_CTRL0_RFC_OBS_MUX0_M \
                                0x0000003F  // Controls which observable 
                                            // signal from RF Core is to be 
                                            // muxed out to rfc_obs_sigs[0]. 00 
                                            // 0000: 0 - Constant value 00 
                                            // 0001: 1 - Constant value 00 
                                            // 1000: rfc_sniff_data - Data from 
                                            // packet sniffer. Sample data on 
                                            // rising edges of sniff_clk. 00 
                                            // 1001: rfc_sniff_clk - 250kHz 
                                            // clock for packet sniffer data. 
                                            // 00 1100: rssi_valid - Pin is 
                                            // high when the RSSI value has 
                                            // been updated at least once since 
                                            // RX was started. Cleared when 
                                            // leaving RX. 00 1101: demod_cca - 
                                            // Clear channel assessment. See 
                                            // FSMSTAT1 register for details on 
                                            // how to configure the behavior of 
                                            // this signal. 00 1110: 
                                            // sampled_cca - A sampled version 
                                            // of the CCA bit from demodulator. 
                                            // The value is updated whenever a 
                                            // SSAMPLECCA or STXONCCA strobe is 
                                            // issued. 00 1111: sfd_sync - Pin 
                                            // is high when a SFD has been 
                                            // received or transmitted. Cleared 
                                            // when leaving RX/TX respectively. 
                                            // Not to be confused with the SFD 
                                            // exception. 01 0000: tx_active - 
                                            // Indicates that FFCTRL is in one 
                                            // of the TX states. Active-high. 
                                            // Note: This signal might have 
                                            // glitches, because it has no 
                                            // output flip-flop and is based on 
                                            // the current state register of 
                                            // the FFCTRL FSM. 01 0001: 
                                            // rx_active - Indicates that 
                                            // FFCTRL is in one of the RX 
                                            // states. Active-high. Note: This 
                                            // signal might have glitches, 
                                            // because it has no output 
                                            // flip-flop and is based on the 
                                            // current state register of the 
                                            // FFCTRL FSM. 01 0010: ffctrl_fifo 
                                            // - Pin is high when one or more 
                                            // bytes are in the RXFIFO. Low 
                                            // during RXFIFO overflow. 01 0011: 
                                            // ffctrl_fifop - Pin is high when 
                                            // the number of bytes in the 
                                            // RXFIFO exceeds the programmable 
                                            // threshold or at least one 
                                            // complete frame is in the RXFIFO. 
                                            // Also high during RXFIFO 
                                            // overflow. Not to be confused 
                                            // with the FIFOP exception. 01 
                                            // 0100: packet_done - A complete 
                                            // frame has been received. I.e., 
                                            // the number of bytes set by the 
                                            // frame-length field has been 
                                            // received. 01 0110: 
                                            // rfc_xor_rand_i_q - XOR between I 
                                            // and Q random outputs. Updated at 
                                            // 8 MHz. 01 0111: rfc_rand_q - 
                                            // Random data output from the Q 
                                            // channel of the receiver. Updated 
                                            // at 8 MHz. 01 1000: rfc_rand_i - 
                                            // Random data output from the I 
                                            // channel of the receiver. Updated 
                                            // at 8 MHz 01 1001: lock_status - 
                                            // 1 when PLL is in lock, otherwise 
                                            // 0 10 1000: pa_pd - Power 
                                            // amplifier power-down signal 10 
                                            // 1010: lna_pd - LNA power-down 
                                            // signal Others: Reserved 

#define RFCORE_XREG_RFC_OBS_CTRL0_RFC_OBS_MUX0_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_RFC_OBS_CTRL1 register.
//
//*****************************************************************************
#define RFCORE_XREG_RFC_OBS_CTRL1_RFC_OBS_POL1 \
                                0x00000040  // The signal chosen by 
                                            // RFC_OBS_MUX1 is XORed with this 
                                            // bit. 

