RIOT-OS/RIOT/cpu/cc2538/include/vendor/hw_rfcore_xreg.h
#define RFCORE_XREG_RFC_OBS_CTRL1_RFC_OBS_POL1_M \
                                0x00000040
#define RFCORE_XREG_RFC_OBS_CTRL1_RFC_OBS_POL1_S 6
#define RFCORE_XREG_RFC_OBS_CTRL1_RFC_OBS_MUX1_M \
                                0x0000003F  // Controls which observable 
                                            // signal from RF Core is to be 
                                            // muxed out to rfc_obs_sigs[1]. 
                                            // See description of RFC_OBS_CTRL0 
                                            // for details. 

#define RFCORE_XREG_RFC_OBS_CTRL1_RFC_OBS_MUX1_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_RFC_OBS_CTRL2 register.
//
//*****************************************************************************
#define RFCORE_XREG_RFC_OBS_CTRL2_RFC_OBS_POL2 \
                                0x00000040  // The signal chosen by 
                                            // RFC_OBS_MUX2 is XORed with this 
                                            // bit. 

#define RFCORE_XREG_RFC_OBS_CTRL2_RFC_OBS_POL2_M \
                                0x00000040
#define RFCORE_XREG_RFC_OBS_CTRL2_RFC_OBS_POL2_S 6
#define RFCORE_XREG_RFC_OBS_CTRL2_RFC_OBS_MUX2_M \
                                0x0000003F  // Controls which observable 
                                            // signal from RF Core is to be 
                                            // muxed out to rfc_obs_sigs[2]. 
                                            // See description of RFC_OBS_CTRL0 
                                            // for details. 

#define RFCORE_XREG_RFC_OBS_CTRL2_RFC_OBS_MUX2_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_TXFILTCFG register.
//
//*****************************************************************************
#define RFCORE_XREG_TXFILTCFG_FC_M \
                                0x0000000F  // Drives signal rfr_txfilt_fc 

#define RFCORE_XREG_TXFILTCFG_FC_S 0


#endif // __HW_RFCORE_XREG_H__

